CSI API ETABS v1
cCaseStaticNonlinear.GetSolControlParameters Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSolControlParameters(
	string Name,
	ref int MaxTotalSteps,
	ref int MaxFailedSubSteps,
	ref int MaxIterCS,
	ref int MaxIterNR,
	ref double TolConvD,
	ref bool UseEventStepping,
	ref double TolEventD,
	ref int MaxLineSearchPerIter,
	ref double TolLineSearch,
	ref double LineSearchStepFact
)
Function GetSolControlParameters (
	Name As String,
	ByRef MaxTotalSteps As Integer,
	ByRef MaxFailedSubSteps As Integer,
	ByRef MaxIterCS As Integer,
	ByRef MaxIterNR As Integer,
	ByRef TolConvD As Double,
	ByRef UseEventStepping As Boolean,
	ByRef TolEventD As Double,
	ByRef MaxLineSearchPerIter As Integer,
	ByRef TolLineSearch As Double,
	ByRef LineSearchStepFact As Double
) As Integer
Dim instance As cCaseStaticNonlinear
Dim Name As String
Dim MaxTotalSteps As Integer
Dim MaxFailedSubSteps As Integer
Dim MaxIterCS As Integer
Dim MaxIterNR As Integer
Dim TolConvD As Double
Dim UseEventStepping As Boolean
Dim TolEventD As Double
Dim MaxLineSearchPerIter As Integer
Dim TolLineSearch As Double
Dim LineSearchStepFact As Double
Dim returnValue As Integer
returnValue = instance.GetSolControlParameters(Name,
	MaxTotalSteps, MaxFailedSubSteps,
	MaxIterCS, MaxIterNR, TolConvD, UseEventStepping,
	TolEventD, MaxLineSearchPerIter,
	TolLineSearch, LineSearchStepFact)
int GetSolControlParameters(
	String^ Name,
	int% MaxTotalSteps,
	int% MaxFailedSubSteps,
	int% MaxIterCS,
	int% MaxIterNR,
	double% TolConvD,
	bool% UseEventStepping,
	double% TolEventD,
	int% MaxLineSearchPerIter,
	double% TolLineSearch,
	double% LineSearchStepFact
)
abstract GetSolControlParameters :
        Name : string *
        MaxTotalSteps : int byref *
        MaxFailedSubSteps : int byref *
        MaxIterCS : int byref *
        MaxIterNR : int byref *
        TolConvD : float byref *
        UseEventStepping : bool byref *
        TolEventD : float byref *
        MaxLineSearchPerIter : int byref *
        TolLineSearch : float byref *
        LineSearchStepFact : float byref -> int
Parameters
Name
Type: System.String
MaxTotalSteps
Type: System.Int32
MaxFailedSubSteps
Type: System.Int32
MaxIterCS
Type: System.Int32
MaxIterNR
Type: System.Int32
TolConvD
Type: System.Double
UseEventStepping
Type: System.Boolean
TolEventD
Type: System.Double
MaxLineSearchPerIter
Type: System.Int32
TolLineSearch
Type: System.Double
LineSearchStepFact
Type: System.Double
Return Value
Type: Int32
See Also
Reference
cCaseStaticNonlinear Interface
ETABSv1 Namespace